app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "email", "password", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Navin"], ["email", "navin@kreatio.com"], ["password", "navin123"], ["type", "EmployeeMember"], ["created_at", "2019-01-05 14:49:14.090333"], ["updated_at", "2019-01-05 14:49:14.090333"]]
---
	def create
		@employee = EmployeeMember.new(employee_params)
		if @employee.save

INSERT INTO "places" ("proposed_place", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["proposed_place", "BBQ"], ["employee_id", 6], ["created_at", "2019-01-06 09:29:26.615491"], ["updated_at", "2019-01-06 09:29:26.615491"]]
---
	def user_place
		if params[:place] && params[:place][:proposed_place]
			@place = Place.new(place_params)
			if @place.save